Охотники_и_рыболовы/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Enums/ТипыПользователей/ТипыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПользователей</name>
  <enumValues>
    <name>ПользовательЛокальногоРешения</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОбластиДанных</name>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Catalogs/ГруппыДичи/ГруппыДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ГруппыДичи</name>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/Дичь/Дичь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дичь</name>
  <tabularSections>
    <name>ВидыДичи</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Охотники_и_рыболовы/src/Catalogs/Охотхозяйства/Охотхозяйства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Охотхозяйства</name>
  <comment>Охотничье хозяйство</comment>
  <predefined>
    <items>
      <name>МоеОхотхозяйство</name>
      <description>Мое охотхозяйство</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СубъектРФ</name>
    <type>
      <types>CatalogRef.СубъектыРФ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоГоловноеПредприятие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧленствоККОООР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРуководителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДниОхоты</name>
    <type>
      <types>EnumRef.УстановленныеДниОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляЗаявления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Охотники_и_рыболовы/src/CommonModules/ОхотаСерверПовтИсп/Module.bsl
Функция ПолучитьТекущийСезон() Экспорт
	Возврат Константы.ТекущийСезон.Получить();	
КонецФункции

Функция РазделениеВключено() Экспорт
	Возврат Ложь;	
КонецФункции

Функция ПолучитьСписокДичи(ВидДичи,Группа) Экспорт
	
	Запрос = Новый Запрос;
	Если Группа Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ГруппыДичиСостав.Ссылка КАК Дичь,
		|	ГруппыДичиСостав.Ссылка.Представление КАК Представление
		|ИЗ
		|	Справочник.ГруппыДичи.Состав КАК ГруппыДичиСостав
		|ГДЕ
		|	ГруппыДичиСостав.Ссылка.ВидДичи = &ВидДичи
		|	И НЕ ГруппыДичиСостав.Дичь.ПометкаУдаления
		|	И НЕ ГруппыДичиСостав.Ссылка.ПометкаУдаления";

	Иначе
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДичьВидыДичи.Ссылка КАК Дичь,
		|	ДичьВидыДичи.Ссылка.Представление КАК Представление
		|ИЗ
		|	Справочник.Дичь.ВидыДичи КАК ДичьВидыДичи
		|ГДЕ
		|	ДичьВидыДичи.ВидДичи = &ВидДичи
		|	И НЕ ДичьВидыДичи.Ссылка.ПометкаУдаления";
	КонецЕсли;
	
	
	Запрос.УстановитьПараметр("ВидДичи", ВидДичи);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокДичи = Новый СписокЗначений;
	Пока Выборка.Следующий() Цикл
		СписокДичи.Добавить(Выборка.Дичь,Выборка.Представление);
	КонецЦикла;
	
	Возврат СписокДичи;	
КонецФункции

Функция ПолучитьПринтер() Экспорт
        
    Скрипт = Новый COMОбъект("MSScriptControl.ScriptControl");
    Скрипт.Language = "vbscript";                 
    Скрипт.AddCode("
         |Function GetDefaultPrinter()
         |GetDefaultPrinter=vbNullString
         |Set objWMIService=GetObject(""winmgmts:"" _
         |& ""{impersonationLevel=impersonate}!\\.\root\cimv2"")
         |Set colInstalledPrinters=objWMIService.ExecQuery _
         |(""Select * from Win32_Printer"")
         |For Each objPrinter in colInstalledPrinters
         |If objPrinter.Attributes and 4 Then
         |GetDefaultPrinter=objPrinter.Name
         |Exit For
         |End If
         |Next
         |End Function");
         
    Возврат СокрЛП(Скрипт.run("GetDefaultPrinter"));
    
КонецФункции

Функция ЦветСтиля(ИмяЦветаСтиля) Экспорт
	Возврат ЦветаСтиля[ИмяЦветаСтиля];
КонецФункции

Функция ПолучитьНастройкуПользователя(ИмяНастройки) Экспорт
	Если ТипЗнч(ИмяНастройки) = Тип("Строка") Тогда
		Настройка = ПланыВидовХарактеристик.НастройкиПользователей.НайтиПоНаименованию(ИмяНастройки,Истина);
	Иначе
		Настройка = ИмяНастройки;
	КонецЕсли;
	
	Значение =  РегистрыСведений.НастройкиПользователей.Получить(
			Новый Структура("Пользователь,Настройка",
			ПараметрыСеанса.ТекущийПользователь,Настройка)).Значение;
			Если Значение = Неопределено Тогда
				Возврат Настройка.ТипЗначения.ПривестиЗначение();
			Иначе
				Возврат Значение;
			КонецЕсли;	
	 	
КонецФункции
		
Функция ОсновныеРоли() Экспорт
	Если Не ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ОсновныеРоли = Метаданные.ОсновныеРоли;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;	
	
	Возврат ОсновныеРоли;
КонецФункции
		
Функция ПолучитьДанныеОхотника(Охотник) Экспорт
	
	ДанныеОхотника = Новый Структура("ЕстьГосБилет,ЕстьЧленскийБилет,Лишен,Исключен,КемВыданЧленскийБилет"
										,Ложь,Ложь,Ложь,Ложь,ПредопределенноеЗначение("Справочник.Охотхозяйства.ПустаяСсылка"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
"ВЫБРАТЬ
|	МАКСИМУМ(ВЫБОР
|			КОГДА ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ГосБилет)
|					И ОхотничьиБилеты.Действует
|				ТОГДА ИСТИНА
|			ИНАЧЕ ЛОЖЬ
|		КОНЕЦ) КАК ЕстьГосБилет,
|	МАКСИМУМ(ВЫБОР
|			КОГДА ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
|					И ОхотничьиБилеты.Действует
|				ТОГДА ИСТИНА
|			ИНАЧЕ ЛОЖЬ
|		КОНЕЦ) КАК ЕстьЧленскийБилет,
|	МАКСИМУМ(ВЫБОР
|			КОГДА ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ЧленскийБилет)
|					И ОхотничьиБилеты.Действует
|				ТОГДА ОхотничьиБилеты.КемВыдан
|			ИНАЧЕ NULL
|		КОНЕЦ) КАК КемВыданЧленскийБилет,
|	ОхотничьиБилеты.Охотник,
|	МАКСИМУМ(ВЫБОР
|			КОГДА ОхотничьиБилеты.Лишен
|				ТОГДА ИСТИНА
|			ИНАЧЕ ЛОЖЬ
|		КОНЕЦ) КАК Лишен,
|	МАКСИМУМ(ВЫБОР
|			КОГДА ОхотничьиБилеты.Исключен
|				ТОГДА ИСТИНА
|			ИНАЧЕ ЛОЖЬ
|		КОНЕЦ) КАК Исключен
|ИЗ
|	РегистрСведений.ОхотничьиБилеты.СрезПоследних(, Охотник = &Охотник) КАК ОхотничьиБилеты
|
|СГРУППИРОВАТЬ ПО
|	ОхотничьиБилеты.Охотник
|
|ИМЕЮЩИЕ
|	НЕ МАКСИМУМ(ВЫБОР
|				КОГДА ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ГосБилет)
|						И ОхотничьиБилеты.Действует
|					ТОГДА ИСТИНА
|				ИНАЧЕ ЛОЖЬ
|			КОНЕЦ) ЕСТЬ NULL";


		
	Запрос.УстановитьПараметр("Охотник",Охотник);	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеОхотника,Выборка);	
	КонецЕсли;
	
	Возврат ДанныеОхотника;
КонецФункции

Функция ДеревоРолей(ПоПодсистемам = Истина, Знач ТипПользователей = Неопределено) Экспорт
	
	Если ТипПользователей = Неопределено Тогда
		ТипПользователей = ?(ОхотаСерверПовтИсп.РазделениеВключено(), 
			Перечисления.ТипыПользователей.ПользовательОбластиДанных, 
			Перечисления.ТипыПользователей.ПользовательЛокальногоРешения);
	КонецЕсли;
	
	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("ЭтоРоль", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Имя",     Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1000)));
	
	Если ПоПодсистемам Тогда
		ЗаполнитьПодсистемыИРоли(Дерево.Строки, , ТипПользователей);
	КонецЕсли;
	
	НедоступныеРоли = ОхотаСлужебный.НедоступныеРолиПоТипуПользователей(ТипПользователей);
	
	// Добавление ненайденных ролей.
	Для каждого Роль Из Метаданные.Роли Цикл
		
		Если НедоступныеРоли.Получить(Роль.Имя) <> Неопределено
			ИЛИ ВРег(Лев(Роль.Имя, СтрДлина("Удалить"))) = ВРег("Удалить")
			ИЛИ ВРег(Лев(Роль.Имя, СтрДлина("Профиль"))) = ВРег("Профиль") Тогда
			
			Продолжить;
		КонецЕсли;
		
		Если Дерево.Строки.НайтиСтроки(Новый Структура("ЭтоРоль, Имя", Истина, Роль.Имя), Истина).Количество() = 0 Тогда
			СтрокаДерева = Дерево.Строки.Добавить();
			СтрокаДерева.ЭтоРоль       = Истина;
			СтрокаДерева.Имя           = Роль.Имя;
			СтрокаДерева.Синоним       = ?(ЗначениеЗаполнено(Роль.Синоним), Роль.Синоним, Роль.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Дерево.Строки.Сортировать("ЭтоРоль Убыв, Синоним Возр", Истина);
	
	Возврат Дерево;
	
КонецФункции

Процедура ЗаполнитьПодсистемыИРоли(КоллекцияСтрокДерева, Подсистемы, ТипПользователей)
	
	НедоступныеРоли = ОхотаСлужебный.НедоступныеРолиПоТипуПользователей(ТипПользователей);
	
	Если Подсистемы = Неопределено Тогда
		Подсистемы = Метаданные.Подсистемы;
	КонецЕсли;
	
	Для каждого Подсистема Из Подсистемы Цикл
		
		ОписаниеПодсистемы = КоллекцияСтрокДерева.Добавить();
		ОписаниеПодсистемы.Имя           = Подсистема.Имя;
		ОписаниеПодсистемы.Синоним       = ?(ЗначениеЗаполнено(Подсистема.Синоним), Подсистема.Синоним, Подсистема.Имя);
		
		ЗаполнитьПодсистемыИРоли(ОписаниеПодсистемы.Строки, Подсистема.Подсистемы, ТипПользователей);
		
		Для каждого Роль Из Метаданные.Роли Цикл
			Если НедоступныеРоли.Получить(Роль) <> Неопределено
				ИЛИ ВРег(Лев(Роль.Имя, СтрДлина("Удалить"))) = ВРег("Удалить") Тогда
				
				Продолжить;
			КонецЕсли;
			
			Если Подсистема.Состав.Содержит(Роль) Тогда
				ОписаниеРоли = ОписаниеПодсистемы.Строки.Добавить();
				ОписаниеРоли.ЭтоРоль       = Истина;
				ОписаниеРоли.Имя           = Роль.Имя;
				ОписаниеРоли.Синоним       = ?(ЗначениеЗаполнено(Роль.Синоним), Роль.Синоним, Роль.Имя);
			КонецЕсли;
		КонецЦикла;
		
		Если ОписаниеПодсистемы.Строки.НайтиСтроки(Новый Структура("ЭтоРоль", Истина), Истина).Количество() = 0 Тогда
			КоллекцияСтрокДерева.Удалить(ОписаниеПодсистемы);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПользовательИмеетПолныеПрава() Экспорт
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

Функция ПолучитьФлагВыводаПредупрежденийПриНачалеРаботы() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Флаг = Константы.ВыводитьПредупреждениеПриЗапуске.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Флаг;
КонецФункции	

Функция ПолучитьПараметрыВыбораПоСубъектуРФ() Экспорт
	РегиональнаяОрганизация = Константы.ГоловноеПредприятие.Получить();
	СубъектРФ = РегиональнаяОрганизация.СубъектРФ;
	Если НЕ РегиональнаяОрганизация.Пустая() Тогда
		НовыйПараметр = Новый ПараметрВыбора("Отбор.СубъектРФ",СубъектРФ);
		НовыйМассив = Новый Массив(1);
		НовыйМассив[0] = НовыйПараметр;
		Возврат Новый ФиксированныйМассив(НовыйМассив);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции
